src/cf/Catalogs/уатПараметрыВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатПараметрыВыработки</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмРасчетаПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесовойКоэффициентДоходовРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнтервала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПериодичностьАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПараметра</Name>
					<Comment>(Itob)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ItobВидыПараметровВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРаботыСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыУпаковки_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Временный</Name>
					<Comment>Признак того, что параметр временной</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаСотрудников</Name>
					<Comment>Действует на сотрудников</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаСотрудниковМЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаТС</Name>
					<Comment>Действует на ТС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаТСЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаТСМЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетализацияВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВДопВыработкеАрендыТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВДопВыработкеЗаказовТакси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВДопВыработкеМЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВСпецработахПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВТарифахНаУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляАрендыТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляЗаказовИПотребности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляЗаказовТакси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляМаршрутныхЛистов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриПланировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПолученияФактЗначенийДляПривлТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатИсточникиФактДанныхПоказателейПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПолученияФактЗначенийДляСобственногоТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатИсточникиФактДанныхПоказателейПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоИнтервалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеДатчика</Name>
					<Comment>(Itob)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobНазначенияДатчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображениеВВидеФлага</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиОС</Name>
					<Comment>Параметр выработки ОС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьВПромежуточныхПунктах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПриПогрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПриРазгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетВремениАренды</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыРасчетВремениАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйЧас</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СводныйПоказатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаЗначений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособыВводаЗначенийВыработкивМЛ_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаПараметровВыработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособРасчетаПараметровВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаПоНомеруЭтапа</Name>
					<Comment>0 - суммировать значения, 1 - выбирать максимальное значение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтейнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыКонтейнеров_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПункта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыПунктов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТочкиМаршрута</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УвеличитьОбщийПробегНаПробегСпец</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловияОтбора</Name>
					<Comment>(Itob)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Comment>(Itob)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ItobНазначенияДатчиков</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Comment>(Itob)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ItobВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>(Itob)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ItobСостоянияТерминалов</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.уатГеозоны_уэ</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатПараметрыВыработки/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// Запрет на просмотр параметров выработки для внешнего пользователя.
	Если уатОбщегоНазначения.ПроверкаВнешнегоПользователя() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	УстановитьЗаголовкиКОРП();
	УстановитьВидимостьЖД();
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.уатПараметрыВыработки) Тогда 
		Элементы.ФормаИзменитьВыделенные.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = Ложь;
	КонецЕсли;
	
	мсвЗапрещенныеКВыбору = Новый Массив();
	
	Если НЕ Константы.уатИспользоватьOmnicomm.Получить()
			И НЕ Константы.уатИспользоватьWialon.Получить()
			И НЕ Константы.уатИспользоватьАвтоГРАФ.Получить()
			И НЕ Константы.уатИспользоватьСКАУТ.Получить()
			И НЕ Константы.уатИспользоватьЦСМ.Получить() Тогда 
		мсвЗапрещенныеКВыбору.Добавить(Справочники.уатПараметрыВыработки.ПробегОбщийПоДаннымGPS);
		мсвЗапрещенныеКВыбору.Добавить(Справочники.уатПараметрыВыработки.ВремяВРаботеПоДаннымGPS);
	КонецЕсли;
	Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		мсвЗапрещенныеКВыбору.Добавить(Справочники.уатПараметрыВыработки.КоличествоКонтейнеров);
	КонецЕсли;
	Если Не уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Или Не ПолучитьФункциональнуюОпцию("уатИспользоватьЖДПеревозки") Тогда
		мсвЗапрещенныеКВыбору.Добавить(Справочники.уатПараметрыВыработки.КоличествоВагонов);
	КонецЕсли;
	
	Элементы.ОтборИспользоватьДляЗаказовТакси.Видимость = уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси();
	Элементы.ИспользоватьДляЗаказовТакси.Видимость      = уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси();
	Элементы.ОтборИспользоватьДляАрендыТС.Видимость     = уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси();
	Элементы.ИспользоватьДляАрендыТС.Видимость          = уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси();

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение   = мсвЗапрещенныеКВыбору;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.Использование    = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборИспользоватьДляЗаказовПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИспользоватьДляЗаказовИПотребности", ОтборИспользоватьДляЗаказов,,, ОтборИспользоватьДляЗаказов);
КонецПроцедуры

&НаКлиенте
Процедура ОтборИспользоватьДляМаршрутныхЛистовПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИспользоватьДляМаршрутныхЛистов", ОтборИспользоватьДляМаршрутныхЛистов,,, ОтборИспользоватьДляМаршрутныхЛистов);
КонецПроцедуры

&НаКлиенте
Процедура ОтборИспользоватьДляТТДПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИспользоватьВТарифахНаУслуги", ОтборИспользоватьДляТТД,,, ОтборИспользоватьДляТТД);
КонецПроцедуры

&НаКлиенте
Процедура ОтборИспользоватьДляЗаказовТаксиПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИспользоватьДляЗаказовТакси", ОтборИспользоватьДляЗаказовТакси,,, ОтборИспользоватьДляЗаказовТакси);
КонецПроцедуры

&НаКлиенте
Процедура ОтборИспользоватьДляАрендыТСПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИспользоватьДляАрендыТС", ОтборИспользоватьДляАрендыТС,,, ОтборИспользоватьДляАрендыТС);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список, Список);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовкиКОРП()
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда 
		Элементы.ОтборИспользоватьДляЗаказов.Заголовок = НСтр("en='Order for trucking, Need for the carriage';ru='Заказ на ТС, Потребность в перевозке'");
		Элементы.ИспользоватьДляЗаказовИПотребности.Заголовок = НСтр("en='Services in orders and requirements';ru='Заказ, Потребность'");
		Элементы.ИспользоватьДляЗаказовИПотребности.Подсказка = НСтр("en='Parameter will be used for the calculation of transportation services according to price lists in documents ""Order for trucking"", ""Order to carrier (by order for trucking)"" and ""Need for the carriage""';ru='Параметр будет использоваться при расчете транспортных услуг по прейскурантам в документах ""Заказ на ТС"", ""Заказ перевозчику (по заказам на ТС)"" и ""Потребность в перевозке""'");
	Иначе 
		Элементы.ОтборИспользоватьДляЗаказов.Заголовок = НСтр("en='Order for trucking';ru='Заказ на ТС'");
		Элементы.ИспользоватьДляЗаказовИПотребности.Заголовок = НСтр("en='Services in orders';ru='Заказ на ТС'");
		Элементы.ИспользоватьДляЗаказовИПотребности.Подсказка = НСтр("en='Parameter will be used for the calculation of transportation services according to price lists in documents ""Order for trucking"" and ""Order to carrier (by order for trucking)""';ru='Параметр будет использоваться при расчете транспортных услуг по прейскурантам в документах ""Заказ на ТС"" и ""Заказ перевозчику (по заказам на ТС)""'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЖД()
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		Элементы.ГруппаРасчетВыработкиВЗаказеНаТС.Видимость = ПолучитьФункциональнуюОпцию("уатИспользоватьЖДПеревозки");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
